memo_configs = {

    "bigdream": {
        "title": "L ビッグドリーム",
        "updated": "2026/05/25",
        "sections": [
            {
                "title": "ゲーム数天井",
                "text":
                    "恩恵はAT当選。<br>"
                    "20%以上で天井短縮あり。",
                "tables": [
                    {
                        "widths": ["100px", "1fr"],
                        "headers": ["種類", "ゲーム数"],
                        "rows": [
                            ["設定変更後", "999G（333G , 555G）"],
                            ["下位AT後", "1,499G（333G , 555G , 999G）"],
                            ["上位AT後", "999G（333G , 555G）"]
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "ボール天井",
                "text":
                    "ボールが落下する度にボール天井pt獲得を抽選。<br>"
                    "プレミアムCZ「ドリームジャックポットチャンス」突入 or 次回ATの1個目が金箱。",
                "images": []
            },
            {
                "title": "辞め時",
                "text": "AT後ヤメ",
                "images": []
            },
            {
                "title": "アイキャッチ",
                "text":
                    "天井ゲーム数を示唆。",
                "tables": [
                    {
                        "widths": ["100px", "1fr"],
                        "headers": ["種類", "示唆"],
                        "rows": [
                            ["通常", "デフォルト（上位AT終了時なら天井555G以下の期待大）"],
                            ["赤", "天井999G以下のチャンス<br>（CZ後なら大チャンス）"],
                            ["キリン柄", "天井333G以下濃厚<br> + ボール天井ptMAX濃厚"]
                        ]
                    }
                ],
                "images": [
                    "画像1.jpg"
                ]
            },
            {
                "title": "PUSHのボイス",
                "text":
                    "CZ失敗時、AT終了時にPUSHボタンを押すとボール天井を示唆するボイスが発生。<br>"
                    "現状、示唆内容は不明。",
                "tables": [
                    {
                        "headers": ["ギルガメッシュ", "エレナ"],
                        "rows": [
                            ["セブンドリーム", "ワオ"],
                            ["インフィニット<br>ドリーム", "グッド"],
                            ["メガドリーム", "フォーカス"],
                            ["ギガドリーム", "マーベラス"],
                            ["テラドリーム", "ファイブ"],
                            ["1万ドリーム", "フォー"],
                            ["ビッグドリーム", "スリー"],
                            ["究極ドリーム", "ツー"],
                            ["ゴールデンドリーム", "ワン"]
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "AT終了画面",
                "text":
                    "設定や天井ゲーム数を示唆。<br>"
                    "※上位AT後は天井555G以下濃厚",
                "tables": [
                    {
                        "widths": ["100px", "1fr"],
                        "headers": ["種類", "示唆"],
                        "rows": [
                            ["帽子", "デフォルト"],
                            ["神化の双剣", "上位AT後デフォルト"],
                            ["銃", "偶数設定期待度UP"],
                            ["剣", "高設定期待度UP"],
                            ["財宝の山", "設定4以上濃厚"],
                            ["立ち絵", "設定2以上濃厚<br> + 天井999G以下濃厚※"],
                            ["見返り", "設定4以上濃厚<br> + 天井999G以下濃厚※"],
                            ["玉座", "設定5以上濃厚<br> + 天井999G以下濃厚※"],
                            ["覚醒ギルガメッシュ", "設定6以上濃厚<br> + 天井999G以下濃厚※"]
                        ]
                    }
                ],
                "images": [
                    "画像2.jpg"
                ]
            }
        ]
    },
    "residentevilre3": {
        "title": "L バイオハザードRE:3",
        "updated": "2026/05/26",
        "sections": [
            {
                "title": "ゲーム数天井",
                "text":
                    "恩恵はパンデミックチャンス + AT当選。",
                "tables": [
                    {
                        "headers": ["種類", "ゲーム数"],
                        "rows": [
                            ["設定変更後", "650G + α"],
                            ["設定変更後以外", "1,000G + α"]
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "CZスルー天井",
                "text":
                    "恩恵はAT当選。<br>"
                    "CZ6スルー後、7回目のCZが成功濃厚。",
                "images": []
            },
            {
                "title": "辞め時",
                "text":
                    "即辞め or pt次第でゾーン確認後辞め。<br>"
                    "<span class='orange'>上位AT後は50ptでCZ当選濃厚のため、即辞め厳禁。</span>",
                "tables": [
                    {
                        "headers": ["状況", "辞め時"],
                        "rows": [
                            ["CZ後", "即辞め<br> or ゾーン確認後辞め"],
                            ["下位AT後", "即辞め<br> or ゾーン確認後辞め"],
                            ["上位AT後", "50ptフォロー"]
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "CZ失敗時のボイス示唆",
                "text":
                    "CZ「ネメシスバトル」失敗時にPUSHボタンを押すとボイスが発生。",
                "tables": [
                    {
                        "headers": ["ボイス", "示唆"],
                        "rows": [
                            ["ここまでね", "デフォルト"],
                            ["どこまでも追ってくる", "残り3回以内示唆"],
                            ["諦めるにはまだ早い", "<span class='green'>残り3回以内濃厚</span>"],
                            ["良いサンプルが取れた", "<span class='red'>次回CZ成功濃厚</span>"],
                            ["私(俺)達は負けない", "<span class='red'>復活濃厚</span>"]
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "NEポイント",
                "text":
                    "液晶右下のNEポイントが規定に到達するとCZ「ネメシスバトル」に当選。<br>"
                    "※期待度は△＜▲＜○＜◎",
                "tables": [
                    {
                        "headers": ["NEポイント", "CZ当選期待度"],
                        "rows": [
                            ["50pt", "△"],
                            ["100pt", "○"],
                            ["150pt", "△"],
                            ["200pt", "▲"],
                            ["250pt", "△"],
                            ["300pt", "◎"],
                            ["350pt", "△"],
                            ["400pt", "○"],
                            ["450pt", "△"],
                            ["500pt", "天井"]
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
}