memo_configs = {
    "sengokuotome5": {
        "title": "L 戦国乙女5 業火を穿つ宿焔の双刃",
        "updated": "2026/05/25",
        "sections": [
            {
                "title": "ゲーム数（周期）天井",
                "text":
                    "恩恵はAT当選。",
                "tables": [
                    {
                        "headers": ["種類", "ゲーム数（周期）"],
                        "rows": [
                            ["設定変更後", "650G + α<br>or 4周期"],
                            ["設定変更後以外", "999G + α<br>or 6周期"]
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "辞め時",
                "text":
                    "AT後辞め or 1周期確認後辞め。",
                "images": []
            },
            {
                "title": "周期テーブル",
                "text":
                    "",
                "tables": [
                    {
                        "headers": ["テーブル", "天井周期"],
                        "rows": [
                            ["テーブルA", "6周期"],
                            ["テーブルA", "3周期"],
                            ["天国", "1周期"]
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "モード毎の当選期待度",
                "text":
                    "",
                "tables": [
                    {
                        "headers": ["G数", "引戻", "A", "B", "C", "ﾁｬﾝｽ"],
                        "rows": [
                            ["50G", "◎", "△", "△", "△", "天井"],
                            ["100G", "△", "ー", "ー", "○", ""],
                            ["200G", "天井", "◎", "○", "天井", ""],
                            ["300G", "", "ー", "天井", "", ""],
                            ["400G", "", "◎", "", "", ""],
                            ["500G", "", "天井", "", "", ""]
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "モードの特徴",
                "text":
                    "",
                "tables": [
                    {
                        "widths": ["100px", "1fr"],
                        "headers": ["モード", "特徴"],
                        "rows": [
                            ["引き戻し", "AT後1周期に選択。<br>モードB以上に移行しやすい。"],
                            ["モードA", "400Gゾーンを超えると、<br>次回モードB以上。"],
                            ["モードB", "次回モードB以上。"],
                            ["モードC", "次回モードC以上。"],
                            ["チャンス", "ー"]
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "AT終了画面",
                "text":
                    "周期テーブルや設定を示唆。",
                "tables": [
                    {
                        "widths": ["130px", "1fr"],
                        "headers": ["画面", "示唆"],
                        "rows": [
                            ["11.jpg", "デフォルト"],
                            ["12.jpg", "テーブルB以上のチャンス"],
                            ["13.jpg", "テーブルB以上のチャンス + 1周期目が100G以内のチャンス"],
                            ["14.jpg", "テーブルB以上濃厚 + 否定で設定4以上濃厚"],
                            ["15.jpg", "天国濃厚 + 否定で設定4以上濃厚"],
                            ["16.jpg", "天国濃厚 + 設定2以上濃厚"],
                            ["17.jpg", "ヨシテルモード濃厚"],
                        ],
                        "image_columns": [0]
                    }
                ],
                "images": []
            },
            {
                "title": "乙女ストラップ",
                "text":
                    "",
                "tables": [
                    {
                        "widths": ["130px", "1fr"],
                        "headers": ["ストラップ", "示唆"],
                        "rows": [
                            ["21.jpg", "周期の規定ゲーム数が最大200G"],
                            ["22.jpg", "強カワチャンス当選率＆加算ゲーム数UP"],
                            ["23.jpg", "テーブルB以上に滞在"],
                            ["24.jpg", "乙女アタック当選率UP"],
                            ["25.jpg", "本能寺の変ストックありでAT開始"],
                            ["26.jpg", "AT当選で剣聖チャンス or 上位AT突入"],
                        ],
                        "image_columns": [0]
                    }
                ],
                "images": []
            },
            {
                "title": "モード選択率",
                "text":
                    "設定変更後はモードB以上。",
                "tables": [
                    {
                        "headers": ["状況", "モードA", "モードB", "モードC"],
                        "rows": [
                            ["設定変更後", "-", "69.9%", "30.1%"],
                            ["AT終了後", "43.2%", "18.6%", "38.2%"]
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "taktopdestiny": {
        "title": "L タクトオーパス",
        "updated": "2026/05/25",
        "sections": [
            {
                "title": "ゲーム数天井",
                "text":
                    "恩恵はAT天井はAT当選、CZ天井はCZ当選。<br>"
                    "<span class='orange'>※天井はボーナス間ではなくAT間のため注意。</span>",
                "tables": [
                    {
                        "headers": ["種類", "ゲーム数"],
                        "rows": [
                            ["設定変更後<br>CZ天井", "300G + α<br>モードB以上濃厚"],
                            ["設定変更後以外<br>CZ天井", "500G + α"],
                            ["設定変更後以外<br>AT天井", "999G + α"]
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "辞め時",
                "text":
                    "AT後辞め or 100G + α辞め。<br>"
                    "※AT後は約40%でモードCを選択。",
                "images": []
            },
            {
                "title": "MB非成立状態狙い",
                "text":
                    "設定変更後やタクト揃い後、黒夜隕鉄モード終了後、赤7終了後はMB非成立状態であり、下記確率でボーナスフラグが成立。<br>"
                    "例えば、11.2%を引き続ければ赤7がループ。",
                "tables": [
                    {
                        "headers": ["フラグ", "割合"],
                        "rows": [
                            ["MB1（中段リリベ）", "6.5%"],
                            ["BIG（赤7）", "11.2%"],
                            ["MB2", "82.3%"]
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "モード当選率",
                "text":
                    "規定ゲーム数は3種類のモードで管理。",
                "tables": [
                    {
                        "headers": ["ゲーム数", "モードA", "モードB", "モードC"],
                        "rows": [
                            ["100G", "-", "▲", "天井"],
                            ["200G", "-", "○", "-"],
                            ["300G", "-", "天井", "-"],
                            ["400G", "▲", "-", "-"],
                            ["500G", "天井", "-", "-"]
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "モード選択率",
                "text":
                    "設定変更後はモードB以上。",
                "tables": [
                    {
                        "headers": ["状況", "モードA", "モードB", "モードC"],
                        "rows": [
                            ["設定変更後", "-", "69.9%", "30.1%"],
                            ["AT終了後", "43.2%", "18.6%", "38.2%"]
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
    "bigdream": {
        "title": "L ビッグドリーム",
        "updated": "2026/05/25",
        "sections": [
            {
                "title": "ゲーム数天井",
                "text":
                    "恩恵はAT当選。<br>"
                    "20%以上で天井短縮あり。",
                "tables": [
                    {
                        "widths": ["100px", "1fr"],
                        "headers": ["種類", "ゲーム数"],
                        "rows": [
                            ["設定変更後", "999G（333G , 555G）"],
                            ["下位AT後", "1,499G<br>（333G , 555G , 999G）"],
                            ["上位AT後", "999G（333G , 555G）"]
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "ボール天井",
                "text":
                    "恩恵はプレミアムCZ「ドリームジャックポットチャンス」突入 or 次回ATの1個目が金箱。<br>"
                    "ボールが落下する度にボール天井pt獲得を抽選。",
                "images": []
            },
            {
                "title": "辞め時",
                "text":
                    "状況やボール位置、ボイスやアイキャッチ等考慮して辞め。<br>"
                    "※基本的に下記参照。",
                "tables": [
                    {
                        "headers": ["状況", "辞め時"],
                        "rows": [
                            ["CZ後", "即辞め"],
                            ["下位AT<br>駆け抜け後", "即辞め"],
                            ["下位AT<br>駆け抜け後以外", "引き戻し確認後辞め"],
                            ["上位AT後", "引き戻し確認後辞め"]
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "アイキャッチ",
                "text":
                    "天井ゲーム数を示唆。",
                "tables": [
                    {
                        "widths": ["100px", "1fr"],
                        "headers": ["種類", "示唆"],
                        "rows": [
                            ["通常", "デフォルト（上位AT終了時なら天井555G以下の期待大）"],
                            ["赤", "天井999G以下のチャンス<br>（CZ後なら大チャンス）"],
                            ["キリン柄", "天井333G以下濃厚<br> + ボール天井ptMAX濃厚"]
                        ]
                    }
                ],
                "images": [
                    "画像1.jpg"
                ]
            },
            {
                "title": "PUSHのボイス",
                "text":
                    "CZ失敗時、AT終了時にPUSHボタンを押すとボール天井を示唆するボイスが発生。<br>"
                    "現状、示唆内容は不明。",
                "tables": [
                    {
                        "headers": ["ギルガメッシュ", "エレナ"],
                        "rows": [
                            ["セブンドリーム", "ワオ"],
                            ["インフィニット<br>ドリーム", "グッド"],
                            ["メガドリーム", "フォーカス"],
                            ["ギガドリーム", "マーベラス"],
                            ["テラドリーム", "ファイブ"],
                            ["1万ドリーム", "フォー"],
                            ["ビッグドリーム", "スリー"],
                            ["究極ドリーム", "ツー"],
                            ["ゴールデンドリーム", "ワン"]
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "AT終了画面",
                "text":
                    "設定や天井ゲーム数を示唆。<br>"
                    "※上位AT後は天井555G以下濃厚",
                "tables": [
                    {
                        "widths": ["100px", "1fr"],
                        "headers": ["種類", "示唆"],
                        "rows": [
                            ["帽子", "デフォルト"],
                            ["神化の双剣", "上位AT後デフォルト"],
                            ["銃", "偶数設定期待度UP"],
                            ["剣", "高設定期待度UP"],
                            ["財宝の山", "設定4以上濃厚"],
                            ["立ち絵", "設定2以上濃厚<br> + 天井999G以下濃厚※"],
                            ["見返り", "設定4以上濃厚<br> + 天井999G以下濃厚※"],
                            ["玉座", "設定5以上濃厚<br> + 天井999G以下濃厚※"],
                            ["覚醒ギルガメッシュ", "設定6以上濃厚<br> + 天井999G以下濃厚※"]
                        ]
                    }
                ],
                "images": [
                    "画像2.jpg"
                ]
            }
        ]
    },
    "residentevilre3": {
        "title": "L バイオハザードRE:3",
        "updated": "2026/05/26",
        "sections": [
            {
                "title": "ゲーム数天井",
                "text":
                    "恩恵はパンデミックチャンス + AT当選。",
                "tables": [
                    {
                        "headers": ["種類", "ゲーム数"],
                        "rows": [
                            ["設定変更後", "650G + α"],
                            ["設定変更後以外", "1,000G + α"]
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "CZスルー天井",
                "text":
                    "恩恵はAT当選。<br>"
                    "CZ6スルー後、7回目のCZが成功濃厚。",
                "images": []
            },
            {
                "title": "辞め時",
                "text":
                    "即辞め or pt次第でゾーン確認後辞め。<br>"
                    "<span class='orange'>上位AT後は50ptでCZ当選濃厚のため、即辞め厳禁。</span>",
                "tables": [
                    {
                        "headers": ["状況", "辞め時"],
                        "rows": [
                            ["CZ後", "即辞め<br> or ゾーン確認後辞め"],
                            ["下位AT後", "即辞め<br> or ゾーン確認後辞め"],
                            ["上位AT後", "50ptフォロー"]
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "CZ失敗時のボイス示唆",
                "text":
                    "CZ「ネメシスバトル」失敗時にPUSHボタンを押すとボイスが発生。",
                "tables": [
                    {
                        "headers": ["ボイス", "示唆"],
                        "rows": [
                            ["ここまでね", "デフォルト"],
                            ["どこまでも追ってくる", "残り3回以内示唆"],
                            ["諦めるにはまだ早い", "<span class='green'>残り3回以内濃厚</span>"],
                            ["良いサンプルが取れた", "<span class='red'>次回CZ成功濃厚</span>"],
                            ["私(俺)達は負けない", "<span class='red'>復活濃厚</span>"]
                        ]
                    }
                ],
                "images": []
            },
            {
                "title": "NEポイント",
                "text":
                    "液晶右下のNEポイントが規定に到達するとCZ「ネメシスバトル」に当選。<br>"
                    "※期待度は△＜▲＜○＜◎",
                "tables": [
                    {
                        "headers": ["NEポイント", "CZ当選期待度"],
                        "rows": [
                            ["50pt", "△"],
                            ["100pt", "○"],
                            ["150pt", "△"],
                            ["200pt", "▲"],
                            ["250pt", "△"],
                            ["300pt", "◎"],
                            ["350pt", "△"],
                            ["400pt", "○"],
                            ["450pt", "△"],
                            ["500pt", "天井"]
                        ]
                    }
                ],
                "images": []
            }
        ]
    },
}